<?php
/**
 * Created by PhpStorm.
 * User: Guangpeng Chen
 * Date: 2016/11/12
 * Time: 14:57
 */
return [
    1=>'商店购买',//（参数：1=>道具商店，2=>联盟商店，3=>冠军商店，4=>全球商店，6=>神秘商店，7=>友好商店）',
    2=>'普通关卡',//（参数：记录通关的关卡id)',
    3=>'精英关卡',//（参数：记录通关的关卡id)',
    4=>'试练挑战',//（参数：记录通关的关卡id)',
    5=>'关卡任务',//（参数：记录完成的任务id)',
    6=>'联盟大赛',//（参数：1=>挑战，2=>排名结算）',
    7=>'祈愿',//（参数：1=>第一次，2=>第二次，3=>第三次，4=>第四次）',
    8=>'好友体力赠送',//（参数：记录今日领取的体力次数）',
    9=>'七日礼包',//（参数：记录领取第几天的礼包）',
    10=>'购买金币',//参数：记录购买次数）
    11=>'购买体力',//（参数：记录购买次数）
    12=>'副本评星奖励',//（参数：记录领取的副本片区id)
    13=>'精灵进化',//（参数：记录精灵的id)
    14=>'分配努力值',//（参数：记录精灵的id)
    15=>'图鉴升级',//（参数：记录精灵的类型id)
    16=>'vip特权礼包',//（参数：记录领取第几级的VIP特权礼包)
    17=>'成就奖励',//（参数：记录成就任务id)
    18=>'狩猎场',//（参数：1=>初级狩猎场，2=>中级狩猎场，3=>高级狩猎场）
    19=>'全球对战',//（参数：1=>对战，2=>星级宝箱，3=>赛季结算）
    20=>'固定交换',//（参数：1=>初级交换，2=>中级交换，3=>高级交换）
    21=>'社团捐献',//（参数：捐献第几次）
    22=>'扭蛋',//（参数：1=>免费扭蛋，2=>购买一次，3=>购买十次）
    23=>'商店刷新',//（参数：2=>联盟商店，3=>冠军商店，4=>全球商店，6=>神秘商店，7=>友好商店）
    24=>'活跃礼包',//（参数：1=>第一个活跃礼包，2=>第二个活跃礼包，3=>第三个活跃礼包）
    25=>'精灵融合',//（参数：记录精灵的id）
    26=>'图鉴合成',//（参数：无）
    27=>'道具出售',//（参数：无）
    28=>'精灵放生',//（参数：无）
    29=>'购买精英副本次数',//（参数：记录精英副本关卡id)
    30=>'一日三餐',//（参数：1=>午餐，2=>晚餐，3=>夜宵）
    31=>'日常任务',//（参数：记录任务的id)
    32=>'兑换码礼包',//（参数：无）
    33=>'封测排名礼包',//（参数：记录名次）
    34=>'封测冲级礼包',//（参数：记录领取的礼包对应的等级）
		35=>'世界BOSS奖励',
		36=>'扩展包下载奖励',
		37=>'礼包物品',
		38=>'金钱副本',
		39=>'整点送体力活动',
		40=>'兑换(万能属性石碎片兑换、万能Mega石碎片兑换)',
		41=>'运营活动',
		
];