<?php
/**
 * typeid => type_name
 */
return array(
    10003=>[
        1 => '启动游戏',
        2 => '解压成功',
        3 => '解压失败',
        4 => '启动页开始',
        5 => '启动页结束',
        6 => '点击百变启程',
        7 => '链接更新服务器成功',
        8 => '链接更新服务器失败',
        9 => '更新成功',
        10 => '更新失败',
        11 => '账号注册成功',
        12 => '账号注册失败',
        13 => '账号验证成功',
        14 => '账号验证失败',
        15 => '进入游戏成功',
        16 => '进入游戏失败',
        17 => '剧情动画开始',
        18 => '剧情动画结束',
        19 => '成功进入游戏',
    ],
);