<?php
/**
 * Created by PhpStorm.
 * User: Guangpeng Chen
 * Date: 8/25-025
 * Time: 21:52
 */
return [
1 =>['t'=>'1、“接受挑战”按钮'],
2 =>['t'=>'2、“完成任务”按钮'],
3 =>['t'=>'3、“前往查看”按钮'],
4 =>['t'=>'4、“消息”按钮'],
5 =>['t'=>'5、“系统消息”按钮'],
6 =>['t'=>'6、“图中步骤”按钮'],
7 =>['t'=>'7、“图中步骤”按钮'],
8 =>['t'=>'8、“图中步骤”按钮'],
9 =>['t'=>'9、“投票”按钮'],
10 =>['t'=>'10、“下一步”按钮'],
11 =>['t'=>'11、“时尚派对”按钮'],
12 =>['t'=>'12、“开始装扮”按钮'],
13 =>['t'=>'13、“知道了”按钮'],
14 =>['t'=>'14、条件筛选框'],
15 =>['t'=>'15、“挑战”按钮'],
16 =>['t'=>'16、“红色礼服”按钮'],
17 =>['t'=>'17、“图中打钩”按钮'],
18 =>['t'=>'18、“知道了”按钮'],
19 =>['t'=>'19、“图中衣服”按钮'],
20 =>['t'=>'20、“购买”按钮'],
21 =>['t'=>'21、“确认”按钮'],
22 =>['t'=>'22、“叉叉”按钮'],
23 =>['t'=>'23、“鞋子”按钮'],
24 =>['t'=>'24、“分享”按钮'],
];

