insert into pre_gift_configs(id,typeId,name,coin,cash,recvCoin,discount,freeCount,littleFlag,orderType,createTime,configName,description)values
(48,6,'月饼',0,10,4,0,0,1,0,1442285641,'zqyb','中秋赏月怎能没有月饼呢？赠送可贡献1点月光。'),
(49,6,'月亮',0,10000,4000,0,0,0,0,1442285641,'yl','中秋佳节，邀请大家来一起赏月吧！赠送可贡献1000点月光。'),
(50,6,'状元饼',0,500,250,0,0,0,0,1442285641,'zyyb','中秋博饼会中获得状元的奖励，送出有特效！'),
(51,6,'榜眼饼',0,200,100,0,0,1,0,1442285641,'byyb','中秋博饼会中获得榜眼的奖励，送出有特效！'),
(52,6,'探花饼',0,100,50,0,0,1,0,1442285641,'thyb','中秋博饼会中获得探花的奖励，送出有特效！'),
(53,6,'进士饼',0,50,25,0,0,0,0,1442285641,'jsyb','中秋博饼会中获得进士的奖励。'),
(54,6,'举人饼',0,20,10,0,0,0,0,1442285641,'jryb','中秋博饼会中获得举人的奖励。'),
(55,6,'秀才饼',0,5,2,0,0,0,0,1442285641,'xcyb','中秋博饼会中获得秀才的奖励。')