<?php
/**
 * Created by PhpStorm.
 * User: Administrator
 * Date: 7/31/14
 * Time: 8:48 AM
 */
$give_emoney_types = array(
    0          => '未知类型',
    1          => '补偿系统',
    2          => '每日签到',
    3          => '新手特权',
    4          => '新手奖励',
    5          => '出监狱失败元宝返还',
    6          => '精彩运营活动',
    7          => '充值返还',
    8          => '群雄争霸奖励',
    9          => '竞技场排名奖励',
    10         => '副本奖励',
    11         => '领取无双令',
    12         => '敲青瓷',
    13         => '宝箱抽奖',
    14         => '军团战奖励',
    15         => '后台发放元宝',
    16         => 'GM命令发放元宝',
    24         => '邮箱提取元宝',
    138        => '称号奖励',
    146        => '成就奖励',
);