<?php
/**
 * Created by PhpStorm.
 * User: Guangpeng Chen
 * Date: 2016/11/12
 * Time: 14:57
 */
return [
    1=>'1商店购买',//（参数：1=>道具商店，2=>联盟商店，3=>冠军商店，4=>全球商店，6=>神秘商店，7=>友好商店）',
    2=>'2普通关卡',//（参数：记录通关的关卡id)',
    3=>'3精英关卡',//（参数：记录通关的关卡id)',
    4=>'4试练挑战',//（参数：记录通关的关卡id)',
    5=>'5关卡任务',//（参数：记录完成的任务id)',
    6=>'6联盟大赛',//（参数：1=>挑战，2=>排名结算）',
    7=>'7祈愿',//（参数：1=>第一次，2=>第二次，3=>第三次，4=>第四次）',
    8=>'8好友体力领取',//（参数：记录今日领取的体力次数）',
    9=>'9七日礼包',//（参数：记录领取第几天的礼包）',
    10=>'10购买金币',//参数：记录购买次数）
    11=>'11购买体力',//（参数：记录购买次数）
    12=>'12副本评星奖励',//（参数：记录领取的副本片区id)
    13=>'13精灵进化',//（参数：记录精灵的id)
    14=>'14分配努力值',//（参数：记录精灵的id)
    15=>'15图鉴升级',//（参数：记录精灵的类型id)
    16=>'16vip特权礼包',//（参数：记录领取第几级的VIP特权礼包)
    17=>'17成就奖励',//（参数：记录成就任务id)
    18=>'18狩猎场',//（参数：1=>初级狩猎场，2=>中级狩猎场，3=>高级狩猎场）
    19=>'19全球对战',//（参数：1=>对战，2=>星级宝箱，3=>赛季结算）
    20=>'20固定交换',//（参数：1=>初级交换，2=>中级交换，3=>高级交换）
    21=>'21社团捐献',//（参数：捐献第几次）
    22=>'22扭蛋',//（参数：1=>免费扭蛋，2=>购买一次，3=>购买十次）
    23=>'23商店刷新',//（参数：2=>联盟商店，3=>冠军商店，4=>全球商店，6=>神秘商店，7=>友好商店）
    24=>'24活跃礼包',//（参数：1=>第一个活跃礼包，2=>第二个活跃礼包，3=>第三个活跃礼包）
    25=>'25精灵融合',//（参数：记录精灵的id）
    26=>'26图鉴合成',//（参数：无）
    27=>'27道具出售',//（参数：无）
    28=>'28精灵放生',//（参数：无）
    29=>'29购买精英副本次数',//（参数：记录精英副本关卡id)
    30=>'30一日三餐',//（参数：1=>午餐，2=>晚餐，3=>夜宵）
    31=>'31日常任务',//（参数：记录任务的id)
    32=>'32兑换码礼包',//（参数：无）
    33=>'33封测排名礼包',//（参数：记录名次）
    34=>'34封测冲级礼包',//（参数：记录领取的礼包对应的等级）
		35=>'35世界BOSS奖励',//（param=1表示排名奖励 param=2表示幸运奖励 param=3表示击杀奖励 param=4表示使用钻石消除战斗冷却）
		36=>'36扩展包下载奖励',
		37=>'37礼包物品',
		38=>'38金钱副本',
		39=>'39整点送体力活动',
		40=>'40兑换(万能属性石碎片兑换、万能Mega石碎片兑换)',
		41=>'41运营活动',
		42=>'42购买固定交换',
		43=>'43还原固定交换',	
		44=>'44刷新固定交换',	
		45=>'45技能购买',
		46=>'46成长基金',
		47=>'47仓库格子',
		48=>'48精灵集训',
		49=>'49精灵重置等级',
		50=>'50时光回溯',
		51=>'51时装',
		52=>'52冒险任务',
		53=>'53亲密度 拓展游玩栏位',
		54=>'54特性',
		55=>'55改名',
		56=>'56签到',
		57=>'57捕捉任务奖励',
		58=>'58充值',
		59=>'59铁人三项购买',
		60=>'60猛兽之战购买',
		61=>'61王牌对决购买',
		62=>'62限时积分',
		63=>'63精灵回购',
		64=>'64椰蛋树战斗奖励',
		65=>'65椰蛋树礼包',
		66=>'66精灵塔参与',
		67=>'67精灵塔通层',
		68=>'68精灵塔首通宝箱',
		69=>'69精灵塔购买宝箱',
		70=>'70精灵塔前10积分',
		71=>'71冠军之夜报名',
		72=>'72悬赏任务',
		73=>'73社团副本小关卡战斗奖励',
		74=>'74技能学习机分解',
		75=>'75参与社团椰蛋树',
		76=>'76社团椰蛋树战斗奖励',
		77=>'77社团椰蛋树礼包奖励',
		78=>'78社团入侵参与',
		79=>'79社团入侵战斗奖励',
		80=>'80铁人三项(副本产出消耗)',
		81=>'81猛兽之战(副本产出消耗)',
		82=>'82王牌对决(副本产出消耗)',
		83=>'83冠军之夜下注',
		84=>'84冠军之夜获取',
		85=>'85社团副本礼包',
		86=>'86精灵暴动参与',
		87=>'87精灵暴动获取',
		88=>'88亲密度 喂食',
		89=>'89亲密度 抚摸',
		90=>'90亲密度 游玩1',
		91=>'91亲密度 游玩2',
		92=>'92亲密度 游玩3',
		93=>'93亲密度 游玩4',
		94=>'94社团争霸押注',
		95=>'95狩猎场精灵出售',
		96=>'96创世徽章激活升阶',
		97=>'97创世徽章升级',
		98=>'98远古守卫(副本产出消耗) ',
        99=>'99精灵冒险结果',
		100=>'100参与社团远古宝藏',
		101=>'101社团远古宝藏积分',
		102=>'102社团悬赏任务',
		103=>'103社团远古宝藏竞标',
		104=>'104社团远古宝藏获得',
		105=>'105联盟大赛挑战次数购买',
		106=>'106全球对战精英宝箱购买',
		107=>'107精灵塔每天达到扫荡条件',
		108=>'108冠军之夜比赛奖励领取',
		109=>'109社团争霸赛奖励',
		110=>'110答题竞猜奖励',
		111=>'111口袋百科奖励',
		112=>'112精灵塔扫荡',
		113=>'113购买霸主精灵挑战次数',
		114=>'114VIP特权商店',
		115=>'115组队副本',
		116=>'116分解魔晶',
		117=>'117霸主精灵扫荡消耗',
		118=>'118技能属性精华购买',
		119=>'119亲密喂食次数购买',
		120=>'120图鉴继承',
		121=>'121高级波伏蕾购买',
		122=>'122性别转换',
		123=>'123挑战霸主精灵 ',
		124=>'124更换狩猎场热点精灵 ',
		125=>'125喵喵聚宝 ',
		126=>'126制作蛋糕 ',
		127=>'127改良蛋糕 ',
		128=>'128蛋糕工坊领取奖励 ',
		129=>'129石板兑换 ',
		130=>'130亲密度系统重置 ',
		131=>'131激活终生月卡 ',
		132=>'132购买狩猎月卡 ',
		133=>'133解锁坐骑 ',
		134=>'134购买普通钻石月卡 ',
		135=>'135洛奇亚爆诞副本通关 ',
		136=>'136洛奇亚爆诞商店购买 ',
		137=>'137洛奇亚爆诞转盘抽奖 ',
		138=>'138洛奇亚爆诞购买行动点数 ',
		139=>'139洛奇亚爆诞副本扫荡 ',
		140=>'140精灵塔参与(简单) ',
		141=>'141精灵塔通层(简单) ',
		142=>'142精灵塔首通宝箱(简单) ',
		143=>'143精灵塔参与(困难) ',
		144=>'144精灵塔通层(困难) ',
		145=>'145精灵塔首通宝箱(困难) ',
		146=>'146刷新悬赏任务 ',
];